# A)T(n)=O(1),T(n)=T(n−1)+O(1),n≥1,T(0)=O(1)
#
# T(n)=T(n−1)+O(1)=T(n−2)+O(1)+O(1)=⋯=T(0)+O(n)=O(n).
# тобто T(n)=O(n).

# D)T(n)=O(1),T(n)=aT(n−a)+O(1),n≥a,a>1
# T(n)=a*T(n−a)+O(1),
# T(n−a)=a*T(n−2a)+O(1),
# Після k ітерацій:
# T(n)=a^k *T(n−ka)+O(a^(k−1))+O(a^(k−2) )+⋯+O(1).
# Для k=⌊n/a⌋:
# T(n)=O(a^(n/a)).

# (g) T(n)=O(1),T(n)=aT(⌊n/a⌋)+O(1),n≥2,a≥2
# T(n)=aT(n/a)+O(1),T(n/a)=aT(n/a^2)+O(1),
# Після k=log a(n) ітерацій:
# T(n)=O(a^(log a(n))=O(n).
# T(n)=O(n).

# (h) T(n)=O(1),T(n)=aT(⌊n/a⌋)+O(n),n≥2,a≥2
# Розкриття рекуренції:
# T(n)=aT(n/a)+O(n),
# T(n/a)=aT(n/a^2)+O(n/a),T(n)=a^2*T(n/a^2)+aO(n/a)+O(n).
# Сума геометричного ряду збігається до O(1), тому:
# T(n)=O(nlogn).