# a) ( summ_(i=0 ; n) i = O(n) )
# Сума перших n натуральних чисел:
# summ_(i=0 ; n) i = n(n+1)/2
# Оскільки n(n+1)/2 = O(n^2)), треба поміняти на (O(n^2)), а не (O(n)).
# 
# b) ( summ_(i=0 ; n) i^2 = O(n) )
# Формула для суми квадратів:
# [ summ_(i=0 ; n) i^2 = n(n+1)(2n+1)/6 ]
# Ця сума зростає як ( O(n^3) ), тож напис ( O(n) ) неправильний.
#  
# c) ( summ_(i=0 ; n) a^i = O(n) )
# Якщо ( a = 1 ), то це просто сума ( n+1 ), тобто ( O(n) ).
# Якщо ( a > 1 ), то маємо геометричну прогресію:
# [ summ_(i=0 ; n) a^i = (a^(n+1) - 1)/a-1 = O(a^n) ]
# Це експоненційне зростання, тобто вираз скоріше ( O(a^n) ), а не ( O(n) ).
# 
# d) ( summ_(i=0 ; n) i^i = O(n^2) )
# Формула для таких сум складна, але ( i^i ) зростає дуже швидко (швидше за ( n^n )), тому оцінка ( O(n^2) ) теж неправильна.
# 
# e) П_{i=1}{n} 1/(1+i) = O(n)
# Розпишемо добуток:
# П_{i=1}{n} 11+i = 1/2 * 1/3 * 1/4 * 1/(n+1)
# Це дає значення близьке до 1/(n+1)!, що прямує до нуля набагато швидше, тобто не є ( O(n) ).
#
# f) ( П_{i=1}{n} 1/1+i! = O(n) )
# Оскільки ( i! ) зростає надзвичайно швидко, кожен множник ( 1/1+i! ) є дуже малим. Для великих ( i ), вираз ( 1 + i! приблизно дорівнює i! ), тому:
# П_{i=1}{n} 1/1+i! майже дорівнює П_{i=1}{n} 1/i!
# Останній добуток швидко прямує до нуля, що суперечить твердженню про ( O(n) ).
#
# 
# g) ( П_{i=1}{n} a^i/1+i! = O(n) )  
# Чисельник ( a^i ) зростає експоненційно а знаменник ( 1 + i! ) — надзвичайно швидко. Оскільки ( i! >> a^i ) при великих ( i ) кожен множник ( a^i/1+i! ) буде малим
# а загальний добуток експоненційно спадатиме. Це точно не ( O(n) ).
#
# 
# h) ( П_{i=1}{n} 1/1+i^m = O(nm) )  
# Для великих ( i ), знаменник ( 1 + i^m практично дорівнює i^m ), тому:
# [ П_{i=1}{n} 1/1+i^m приблизно дорівнює П_{i=1}{n} 1/i^m = ( П_{i=1}{n} 1/i)^m. ]  
# Добуток ( П_{i=1}{n} 1/i = 1/n! ) спадає дуже швидко, що не є ( O(nm) ).
#
# 
# i) ( П_{i=1}{n} 1/1+i^i = O(n^2) )  
# Знаменник ( 1 + i^i практично дорівнює i^i ), отже:
# [ П_{i=1}{n} 1/1+i^i майже дорівнює П_{i=1}{n} 1/i^i. ]
# Факторіальний добуток ( П_{i=1}{n} 1/i^i ) спадає надзвичайно швидко, це доказує що ( O(n^2) ) є некоректною.
